000100 IDENTIFICATION DIVISION.
000150 PROGRAM-ID. PASSWORD-ENCODER.
000200 
000300 ENVIRONMENT DIVISION.
000350 INPUT-OUTPUT SECTION.
000360 FILE-CONTROL.
000370 
000400 DATA DIVISION.
000450 FILE SECTION.
000460 
000500 WORKING-STORAGE SECTION.
000510 01 PASSPLAIN PIC X(28).
000520 01 PASSENCODED PIC X(28).
000530 01 STRING-LENGTH PIC 9(3).
000540 01 I PIC 9(3) VALUE 1.
000550 01 J PIC 9(3) VALUE 1.
000560 01 TEMP-CHAR PIC X(1).
000570 01 CHAR-ASCII PIC 9(3).
000580 
000600 PROCEDURE DIVISION.
000610 MAIN-LOGIC.
000615     ACCEPT PASSPLAIN FROM SYSIN.
000620     INSPECT PASSPLAIN TALLYING STRING-LENGTH FOR CHARACTERS
000620     BEFORE INITIAL " ".
000620     
000625     PERFORM VARYING I FROM 1 BY 1 UNTIL I > STRING-LENGTH
000630         MOVE PASSPLAIN(I:1) TO TEMP-CHAR
000635         COMPUTE CHAR-ASCII = FUNCTION ORD (TEMP-CHAR) - 1
000640
000650         IF J = 1 THEN
000655             ADD I TO CHAR-ASCII
000660             ADD 16 TO CHAR-ASCII
000666             MOVE 2 TO J
000670         ELSE IF J = 2 THEN
000675             ADD I TO CHAR-ASCII
000680             SUBTRACT 25 FROM CHAR-ASCII
000685             MOVE 3 TO J
000690         ELSE IF J = 3 THEN
000695             ADD I TO CHAR-ASCII
000700             COMPUTE CHAR-ASCII= (12*2) + (40/5) - 13 + CHAR-ASCII
000705             MOVE 4 TO J
000710         ELSE IF J = 4 THEN
000715             ADD I TO CHAR-ASCII
000720             IF FUNCTION MOD(CHAR-ASCII,2) = 0 THEN
000725                  ADD 2 TO CHAR-ASCII
000730             ELSE
000735                  SUBTRACT 51 FROM CHAR-ASCII
000740             END-IF
000745             IF FUNCTION MOD(CHAR-ASCII,2) = 0 THEN
000750                  COMPUTE CHAR-ASCII= (CHAR-ASCII/2)+(3**2)+(2**4)
000755             END-IF
000760             MOVE 1 TO J
000765         END-IF END-IF END-IF END-IF
000770         MOVE FUNCTION CHAR (CHAR-ASCII + 1) TO PASSENCODED(I:1)
000777     END-PERFORM
000780     DISPLAY "Encoded Password: " FUNCTION HEX-OF(PASSENCODED).
001000     STOP RUN.
